<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"c48dc56421d1436e7a0e9637bd41a52babedbd78c5f655a09ffbb7e917ec90b4","plan_job_ref":"Job Test actions using target and replace #504 at https://github.com/dflook/terraform-github-actions/actions/runs/15345085174","plan_out_hash":"cec019b5f627a6a4b466a48e468d46999e254404b4b4abf517bb76d9c72980d9","plan_hash":"b62662542273fb69d01d87a472d54f6d5c627686511dd0b9d0fd9a376ce19284","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "OAJ3zsgWy5" -> (known after apply)
!~  foreach = "0A6gU2ejgt" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #504](https://github.com/dflook/terraform-github-actions/actions/runs/15345085174)